makers_sports/app/controllers/organizations_controller.rb

    def index
        render json: Organization.all, status: :ok
---
SELECT "organizations".* FROM "organizations"