makers_sports/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
    def index
        render json: Player.all, status: :ok

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        player = Player.find(params[:id])

INSERT INTO "players" ("p_name", "p_birthday", "p_nationality", "height", "weight", "position", "image", "user_id", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        player = Player.create!(player_params)

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "players" SET "p_name" = $1, "p_nationality" = $2, "height" = $3, "weight" = $4, "position" = $5, "updated_at" = $6 WHERE "players"."id" = $7  [["p_name", "Jose Brizuela Jr"], ["p_nationality", "Caracas, Venezuela"], ["height", 182], ["weight", 223], ["position", "RF"], ["updated_at", "2023-01-05 18:12:40.795151"], ["id", 3]]
---
    def update
        player = Player.find(params[:id])
        player.update!(player_params)

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 1]]
---
    def destroy
        player = Player.find(params[:id])
        player.destroy