makers_sports/app/controllers/sessions_controller.rb

    def create # '/login'

        user = User.find_by(name:params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "paberto"], ["LIMIT", 1]]