makers_sports/app/controllers/users_controller.rb

   def create

       user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "paolomgarcia"], ["email", "paolo@makers.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-23 19:01:31.616244"], ["updated_at", "2022-12-23 19:01:31.616244"]]